jRicardoChG/dsPic/dsPicADCMOTOR/xc.h
/*
 *  xc.h 
 *
 *  Generic include file for XC16
 *
 *  Copyright 2012 Microchip Technology
 */

#if defined(__PIC24EP128GP202__)
#include <p24EP128GP202.h>
#endif

#if defined(__PIC24EP128GP204__)
#include <p24EP128GP204.h>
#endif

#if defined(__PIC24EP128GP206__)
#include <p24EP128GP206.h>
#endif

#if defined(__PIC24EP128MC202__)
#include <p24EP128MC202.h>
#endif

#if defined(__PIC24EP128MC204__)
#include <p24EP128MC204.h>
#endif

#if defined(__PIC24EP128MC206__)
#include <p24EP128MC206.h>
#endif

#if defined(__PIC24EP256GP202__)
#include <p24EP256GP202.h>
#endif

#if defined(__PIC24EP256GP204__)
#include <p24EP256GP204.h>
#endif

#if defined(__PIC24EP256GP206__)
#include <p24EP256GP206.h>
#endif

#if defined(__PIC24EP256GU810__)
#include <p24EP256GU810.h>
#endif

#if defined(__PIC24EP256GU814__)
#include <p24EP256GU814.h>
#endif

#if defined(__PIC24EP256MC202__)
#include <p24EP256MC202.h>
#endif

#if defined(__PIC24EP256MC204__)
#include <p24EP256MC204.h>
#endif

#if defined(__PIC24EP256MC206__)
#include <p24EP256MC206.h>
#endif

#if defined(__PIC24EP32GP202__)
#include <p24EP32GP202.h>
#endif

#if defined(__PIC24EP32GP203__)
#include <p24EP32GP203.h>
#endif

#if defined(__PIC24EP32GP204__)
#include <p24EP32GP204.h>
#endif

#if defined(__PIC24EP32MC202__)
#include <p24EP32MC202.h>
#endif

#if defined(__PIC24EP32MC203__)
#include <p24EP32MC203.h>
#endif

#if defined(__PIC24EP32MC204__)
#include <p24EP32MC204.h>
#endif

#if defined(__PIC24EP512GP202__)
#include <p24EP512GP202.h>
#endif

#if defined(__PIC24EP512GP204__)
#include <p24EP512GP204.h>
#endif

#if defined(__PIC24EP512GP206__)
#include <p24EP512GP206.h>
#endif

#if defined(__PIC24EP512GP806__)
#include <p24EP512GP806.h>
#endif

#if defined(__PIC24EP512GU810__)
#include <p24EP512GU810.h>
#endif

#if defined(__PIC24EP512GU814__)
#include <p24EP512GU814.h>
#endif

#if defined(__PIC24EP512MC202__)
#include <p24EP512MC202.h>
#endif

#if defined(__PIC24EP512MC204__)
#include <p24EP512MC204.h>
#endif

#if defined(__PIC24EP512MC206__)
#include <p24EP512MC206.h>
#endif

#if defined(__PIC24EP64GP202__)
#include <p24EP64GP202.h>
#endif

#if defined(__PIC24EP64GP203__)
#include <p24EP64GP203.h>
#endif

#if defined(__PIC24EP64GP204__)
#include <p24EP64GP204.h>
#endif

#if defined(__PIC24EP64GP206__)
#include <p24EP64GP206.h>
#endif

#if defined(__PIC24EP64MC202__)
#include <p24EP64MC202.h>
#endif

#if defined(__PIC24EP64MC203__)
#include <p24EP64MC203.h>
#endif

#if defined(__PIC24EP64MC204__)
#include <p24EP64MC204.h>
#endif

#if defined(__PIC24EP64MC206__)
#include <p24EP64MC206.h>
#endif

#if defined(__PIC24F04KA200__)
#include <p24F04KA200.h>
#endif

#if defined(__PIC24F04KA201__)
#include <p24F04KA201.h>
#endif

#if defined(__PIC24F04KL100__)
#include <p24F04KL100.h>
#endif

#if defined(__PIC24F04KL101__)
#include <p24F04KL101.h>
#endif

#if defined(__PIC24F08KA101__)
#include <p24F08KA101.h>
#endif

#if defined(__PIC24F08KA102__)
#include <p24F08KA102.h>
#endif

#if defined(__PIC24F08KL200__)
#include <p24F08KL200.h>
#endif

#if defined(__PIC24F08KL201__)
#include <p24F08KL201.h>
#endif

#if defined(__PIC24F08KL301__)
#include <p24F08KL301.h>
#endif

#if defined(__PIC24F08KL302__)
#include <p24F08KL302.h>
#endif

#if defined(__PIC24F08KL401__)
#include <p24F08KL401.h>
#endif

#if defined(__PIC24F08KL402__)
#include <p24F08KL402.h>
#endif

#if defined(__PIC24F08KM101__)
#include <p24F08KM101.h>
#endif

#if defined(__PIC24F08KM102__)
#include <p24F08KM102.h>
#endif

#if defined(__PIC24F08KM202__)
#include <p24F08KM202.h>
#endif

#if defined(__PIC24F08KM204__)
#include <p24F08KM204.h>
#endif

#if defined(__PIC24F16KA101__)
#include <p24F16KA101.h>
#endif

#if defined(__PIC24F16KA102__)
#include <p24F16KA102.h>
#endif

#if defined(__PIC24F16KA301__)
#include <p24F16KA301.h>
#endif

#if defined(__PIC24F16KA302__)
#include <p24F16KA302.h>
#endif

#if defined(__PIC24F16KA304__)
#include <p24F16KA304.h>
#endif

#if defined(__PIC24F16KL401__)
#include <p24F16KL401.h>
#endif

#if defined(__PIC24F16KL402__)
#include <p24F16KL402.h>
#endif

#if defined(__PIC24F16KM102__)
#include <p24F16KM102.h>
#endif

#if defined(__PIC24F16KM104__)
#include <p24F16KM104.h>
#endif

#if defined(__PIC24F16KM202__)
#include <p24F16KM202.h>
#endif

#if defined(__PIC24F16KM204__)
#include <p24F16KM204.h>
#endif

#if defined(__PIC24F32KA301__)
#include <p24F32KA301.h>
#endif

#if defined(__PIC24F32KA302__)
#include <p24F32KA302.h>
#endif

#if defined(__PIC24F32KA304__)
#include <p24F32KA304.h>
#endif

#if defined(__PIC24FJ1024GA606__)
#include <p24FJ1024GA606.h>
#endif

#if defined(__PIC24FJ1024GA610__)
#include <p24FJ1024GA610.h>
#endif

#if defined(__PIC24FJ1024GB606__)
#include <p24FJ1024GB606.h>
#endif

#if defined(__PIC24FJ1024GB610__)
#include <p24FJ1024GB610.h>
#endif

#if defined(__PIC24FJ128DA106__)
#include <p24FJ128DA106.h>
#endif

#if defined(__PIC24FJ128DA110__)
#include <p24FJ128DA110.h>
#endif

#if defined(__PIC24FJ128DA206__)
#include <p24FJ128DA206.h>
#endif

#if defined(__PIC24FJ128DA210__)
#include <p24FJ128DA210.h>
#endif

#if defined(__PIC24FJ128GA006__)
#include <p24FJ128GA006.h>
#endif

#if defined(__PIC24FJ128GA008__)
#include <p24FJ128GA008.h>
#endif

#if defined(__PIC24FJ128GA010__)
#include <p24FJ128GA010.h>
#endif

#if defined(__PIC24FJ128GA106__)
#include <p24FJ128GA106.h>
#endif

#if defined(__PIC24FJ128GA108__)
#include <p24FJ128GA108.h>
#endif

#if defined(__PIC24FJ128GA110__)
#include <p24FJ128GA110.h>
#endif

#if defined(__PIC24FJ128GA202__)
#include <p24FJ128GA202.h>
#endif

#if defined(__PIC24FJ128GA204__)
#include <p24FJ128GA204.h>
#endif

#if defined(__PIC24FJ128GA306__)
#include <p24FJ128GA306.h>
#endif

#if defined(__PIC24FJ128GA308__)
#include <p24FJ128GA308.h>
#endif

#if defined(__PIC24FJ128GA310__)
#include <p24FJ128GA310.h>
#endif

#if defined(__PIC24FJ128GA406__)
#include <p24FJ128GA406.h>
#endif

#if defined(__PIC24FJ128GA410__)
#include <p24FJ128GA410.h>
#endif

#if defined(__PIC24FJ128GA412__)
#include <p24FJ128GA412.h>
#endif

