jRicardoChG/dsPic/dsPicADCMOTOR/xc.h
#if defined(__PIC24FJ128GA606__)
#include <p24FJ128GA606.h>
#endif

#if defined(__PIC24FJ128GA610__)
#include <p24FJ128GA610.h>
#endif

#if defined(__PIC24FJ128GA702__)
#include <p24FJ128GA702.h>
#endif

#if defined(__PIC24FJ128GA704__)
#include <p24FJ128GA704.h>
#endif

#if defined(__PIC24FJ128GA705__)
#include <p24FJ128GA705.h>
#endif

#if defined(__PIC24FJ128GB106__)
#include <p24FJ128GB106.h>
#endif

#if defined(__PIC24FJ128GB108__)
#include <p24FJ128GB108.h>
#endif

#if defined(__PIC24FJ128GB110__)
#include <p24FJ128GB110.h>
#endif

#if defined(__PIC24FJ128GB202__)
#include <p24FJ128GB202.h>
#endif

#if defined(__PIC24FJ128GB204__)
#include <p24FJ128GB204.h>
#endif

#if defined(__PIC24FJ128GB206__)
#include <p24FJ128GB206.h>
#endif

#if defined(__PIC24FJ128GB210__)
#include <p24FJ128GB210.h>
#endif

#if defined(__PIC24FJ128GB406__)
#include <p24FJ128GB406.h>
#endif

#if defined(__PIC24FJ128GB410__)
#include <p24FJ128GB410.h>
#endif

#if defined(__PIC24FJ128GB412__)
#include <p24FJ128GB412.h>
#endif

#if defined(__PIC24FJ128GB606__)
#include <p24FJ128GB606.h>
#endif

#if defined(__PIC24FJ128GB610__)
#include <p24FJ128GB610.h>
#endif

#if defined(__PIC24FJ128GC006__)
#include <p24FJ128GC006.h>
#endif

#if defined(__PIC24FJ128GC010__)
#include <p24FJ128GC010.h>
#endif

#if defined(__PIC24FJ16GA002__)
#include <p24FJ16GA002.h>
#endif

#if defined(__PIC24FJ16GA004__)
#include <p24FJ16GA004.h>
#endif

#if defined(__PIC24FJ16MC101__)
#include <p24FJ16MC101.h>
#endif

#if defined(__PIC24FJ16MC102__)
#include <p24FJ16MC102.h>
#endif

#if defined(__PIC24FJ192GA106__)
#include <p24FJ192GA106.h>
#endif

#if defined(__PIC24FJ192GA108__)
#include <p24FJ192GA108.h>
#endif

#if defined(__PIC24FJ192GA110__)
#include <p24FJ192GA110.h>
#endif

#if defined(__PIC24FJ192GB106__)
#include <p24FJ192GB106.h>
#endif

#if defined(__PIC24FJ192GB108__)
#include <p24FJ192GB108.h>
#endif

#if defined(__PIC24FJ192GB110__)
#include <p24FJ192GB110.h>
#endif

#if defined(__PIC24FJ256DA106__)
#include <p24FJ256DA106.h>
#endif

#if defined(__PIC24FJ256DA110__)
#include <p24FJ256DA110.h>
#endif

#if defined(__PIC24FJ256DA206__)
#include <p24FJ256DA206.h>
#endif

#if defined(__PIC24FJ256DA210__)
#include <p24FJ256DA210.h>
#endif

#if defined(__PIC24FJ256GA106__)
#include <p24FJ256GA106.h>
#endif

#if defined(__PIC24FJ256GA108__)
#include <p24FJ256GA108.h>
#endif

#if defined(__PIC24FJ256GA110__)
#include <p24FJ256GA110.h>
#endif

#if defined(__PIC24FJ256GA406__)
#include <p24FJ256GA406.h>
#endif

#if defined(__PIC24FJ256GA410__)
#include <p24FJ256GA410.h>
#endif

#if defined(__PIC24FJ256GA412__)
#include <p24FJ256GA412.h>
#endif

#if defined(__PIC24FJ256GA606__)
#include <p24FJ256GA606.h>
#endif

#if defined(__PIC24FJ256GA610__)
#include <p24FJ256GA610.h>
#endif

#if defined(__PIC24FJ256GA702__)
#include <p24FJ256GA702.h>
#endif

#if defined(__PIC24FJ256GA704__)
#include <p24FJ256GA704.h>
#endif

#if defined(__PIC24FJ256GA705__)
#include <p24FJ256GA705.h>
#endif

#if defined(__PIC24FJ256GB106__)
#include <p24FJ256GB106.h>
#endif

#if defined(__PIC24FJ256GB108__)
#include <p24FJ256GB108.h>
#endif

#if defined(__PIC24FJ256GB110__)
#include <p24FJ256GB110.h>
#endif

#if defined(__PIC24FJ256GB206__)
#include <p24FJ256GB206.h>
#endif

#if defined(__PIC24FJ256GB210__)
#include <p24FJ256GB210.h>
#endif

#if defined(__PIC24FJ256GB406__)
#include <p24FJ256GB406.h>
#endif

#if defined(__PIC24FJ256GB410__)
#include <p24FJ256GB410.h>
#endif

#if defined(__PIC24FJ256GB412__)
#include <p24FJ256GB412.h>
#endif

#if defined(__PIC24FJ256GB606__)
#include <p24FJ256GB606.h>
#endif

#if defined(__PIC24FJ256GB610__)
#include <p24FJ256GB610.h>
#endif

#if defined(__PIC24FJ32GA002__)
#include <p24FJ32GA002.h>
#endif

#if defined(__PIC24FJ32GA004__)
#include <p24FJ32GA004.h>
#endif

#if defined(__PIC24FJ32GA102__)
#include <p24FJ32GA102.h>
#endif

#if defined(__PIC24FJ32GA104__)
#include <p24FJ32GA104.h>
#endif

#if defined(__PIC24FJ32GB002__)
#include <p24FJ32GB002.h>
#endif

#if defined(__PIC24FJ32GB004__)
#include <p24FJ32GB004.h>
#endif

#if defined(__PIC24FJ32MC101__)
#include <p24FJ32MC101.h>
#endif

#if defined(__PIC24FJ32MC102__)
#include <p24FJ32MC102.h>
#endif

#if defined(__PIC24FJ32MC104__)
#include <p24FJ32MC104.h>
#endif

#if defined(__PIC24FJ48GA002__)
#include <p24FJ48GA002.h>
#endif

#if defined(__PIC24FJ48GA004__)
#include <p24FJ48GA004.h>
#endif

#if defined(__PIC24FJ512GA606__)
#include <p24FJ512GA606.h>
#endif

#if defined(__PIC24FJ512GA610__)
#include <p24FJ512GA610.h>
#endif

#if defined(__PIC24FJ512GB606__)
#include <p24FJ512GB606.h>
#endif

#if defined(__PIC24FJ512GB610__)
#include <p24FJ512GB610.h>
#endif

#if defined(__PIC24FJ64GA002__)
#include <p24FJ64GA002.h>
#endif

#if defined(__PIC24FJ64GA004__)
#include <p24FJ64GA004.h>
#endif

#if defined(__PIC24FJ64GA006__)
#include <p24FJ64GA006.h>
#endif

#if defined(__PIC24FJ64GA008__)
#include <p24FJ64GA008.h>
#endif

#if defined(__PIC24FJ64GA010__)
#include <p24FJ64GA010.h>
#endif

#if defined(__PIC24FJ64GA102__)
#include <p24FJ64GA102.h>
#endif

#if defined(__PIC24FJ64GA104__)
#include <p24FJ64GA104.h>
#endif

#if defined(__PIC24FJ64GA106__)
#include <p24FJ64GA106.h>
#endif

#if defined(__PIC24FJ64GA108__)
#include <p24FJ64GA108.h>
#endif

#if defined(__PIC24FJ64GA110__)
#include <p24FJ64GA110.h>
#endif

#if defined(__PIC24FJ64GA202__)
#include <p24FJ64GA202.h>
#endif

#if defined(__PIC24FJ64GA204__)
#include <p24FJ64GA204.h>
#endif

#if defined(__PIC24FJ64GA306__)
#include <p24FJ64GA306.h>
#endif

#if defined(__PIC24FJ64GA308__)
#include <p24FJ64GA308.h>
#endif

#if defined(__PIC24FJ64GA310__)
#include <p24FJ64GA310.h>
#endif

#if defined(__PIC24FJ64GA406__)
#include <p24FJ64GA406.h>
#endif

#if defined(__PIC24FJ64GA410__)
#include <p24FJ64GA410.h>
#endif

#if defined(__PIC24FJ64GA412__)
#include <p24FJ64GA412.h>
#endif

#if defined(__PIC24FJ64GA702__)
#include <p24FJ64GA702.h>
#endif

#if defined(__PIC24FJ64GA704__)
#include <p24FJ64GA704.h>
#endif

#if defined(__PIC24FJ64GA705__)
#include <p24FJ64GA705.h>
#endif

