jRicardoChG/dsPic/dsPicADCMOTOR/xc.h
#if defined(__PIC24FJ64GB002__)
#include <p24FJ64GB002.h>
#endif

#if defined(__PIC24FJ64GB004__)
#include <p24FJ64GB004.h>
#endif

#if defined(__PIC24FJ64GB106__)
#include <p24FJ64GB106.h>
#endif

#if defined(__PIC24FJ64GB108__)
#include <p24FJ64GB108.h>
#endif

#if defined(__PIC24FJ64GB110__)
#include <p24FJ64GB110.h>
#endif

#if defined(__PIC24FJ64GB202__)
#include <p24FJ64GB202.h>
#endif

#if defined(__PIC24FJ64GB204__)
#include <p24FJ64GB204.h>
#endif

#if defined(__PIC24FJ64GB406__)
#include <p24FJ64GB406.h>
#endif

#if defined(__PIC24FJ64GB410__)
#include <p24FJ64GB410.h>
#endif

#if defined(__PIC24FJ64GB412__)
#include <p24FJ64GB412.h>
#endif

#if defined(__PIC24FJ64GC006__)
#include <p24FJ64GC006.h>
#endif

#if defined(__PIC24FJ64GC010__)
#include <p24FJ64GC010.h>
#endif

#if defined(__PIC24FJ96GA006__)
#include <p24FJ96GA006.h>
#endif

#if defined(__PIC24FJ96GA008__)
#include <p24FJ96GA008.h>
#endif

#if defined(__PIC24FJ96GA010__)
#include <p24FJ96GA010.h>
#endif

#if defined(__PIC24FV08KM101__)
#include <p24FV08KM101.h>
#endif

#if defined(__PIC24FV08KM102__)
#include <p24FV08KM102.h>
#endif

#if defined(__PIC24FV08KM202__)
#include <p24FV08KM202.h>
#endif

#if defined(__PIC24FV08KM204__)
#include <p24FV08KM204.h>
#endif

#if defined(__PIC24FV16KA301__)
#include <p24FV16KA301.h>
#endif

#if defined(__PIC24FV16KA302__)
#include <p24FV16KA302.h>
#endif

#if defined(__PIC24FV16KA304__)
#include <p24FV16KA304.h>
#endif

#if defined(__PIC24FV16KM102__)
#include <p24FV16KM102.h>
#endif

#if defined(__PIC24FV16KM104__)
#include <p24FV16KM104.h>
#endif

#if defined(__PIC24FV16KM202__)
#include <p24FV16KM202.h>
#endif

#if defined(__PIC24FV16KM204__)
#include <p24FV16KM204.h>
#endif

#if defined(__PIC24FV32KA301__)
#include <p24FV32KA301.h>
#endif

#if defined(__PIC24FV32KA302__)
#include <p24FV32KA302.h>
#endif

#if defined(__PIC24FV32KA304__)
#include <p24FV32KA304.h>
#endif

#if defined(__PIC24HJ128GP202__)
#include <p24HJ128GP202.h>
#endif

#if defined(__PIC24HJ128GP204__)
#include <p24HJ128GP204.h>
#endif

#if defined(__PIC24HJ128GP206__)
#include <p24HJ128GP206.h>
#endif

#if defined(__PIC24HJ128GP206A__)
#include <p24HJ128GP206A.h>
#endif

#if defined(__PIC24HJ128GP210__)
#include <p24HJ128GP210.h>
#endif

#if defined(__PIC24HJ128GP210A__)
#include <p24HJ128GP210A.h>
#endif

#if defined(__PIC24HJ128GP306__)
#include <p24HJ128GP306.h>
#endif

#if defined(__PIC24HJ128GP306A__)
#include <p24HJ128GP306A.h>
#endif

#if defined(__PIC24HJ128GP310__)
#include <p24HJ128GP310.h>
#endif

#if defined(__PIC24HJ128GP310A__)
#include <p24HJ128GP310A.h>
#endif

#if defined(__PIC24HJ128GP502__)
#include <p24HJ128GP502.h>
#endif

#if defined(__PIC24HJ128GP504__)
#include <p24HJ128GP504.h>
#endif

#if defined(__PIC24HJ128GP506__)
#include <p24HJ128GP506.h>
#endif

#if defined(__PIC24HJ128GP506A__)
#include <p24HJ128GP506A.h>
#endif

#if defined(__PIC24HJ128GP510__)
#include <p24HJ128GP510.h>
#endif

#if defined(__PIC24HJ128GP510A__)
#include <p24HJ128GP510A.h>
#endif

#if defined(__PIC24HJ12GP201__)
#include <p24HJ12GP201.h>
#endif

#if defined(__PIC24HJ12GP202__)
#include <p24HJ12GP202.h>
#endif

#if defined(__PIC24HJ16GP304__)
#include <p24HJ16GP304.h>
#endif

#if defined(__PIC24HJ256GP206__)
#include <p24HJ256GP206.h>
#endif

#if defined(__PIC24HJ256GP206A__)
#include <p24HJ256GP206A.h>
#endif

#if defined(__PIC24HJ256GP210__)
#include <p24HJ256GP210.h>
#endif

#if defined(__PIC24HJ256GP210A__)
#include <p24HJ256GP210A.h>
#endif

#if defined(__PIC24HJ256GP610__)
#include <p24HJ256GP610.h>
#endif

#if defined(__PIC24HJ256GP610A__)
#include <p24HJ256GP610A.h>
#endif

#if defined(__PIC24HJ32GP202__)
#include <p24HJ32GP202.h>
#endif

#if defined(__PIC24HJ32GP204__)
#include <p24HJ32GP204.h>
#endif

#if defined(__PIC24HJ32GP302__)
#include <p24HJ32GP302.h>
#endif

#if defined(__PIC24HJ32GP304__)
#include <p24HJ32GP304.h>
#endif

#if defined(__PIC24HJ64GP202__)
#include <p24HJ64GP202.h>
#endif

#if defined(__PIC24HJ64GP204__)
#include <p24HJ64GP204.h>
#endif

#if defined(__PIC24HJ64GP206__)
#include <p24HJ64GP206.h>
#endif

#if defined(__PIC24HJ64GP206A__)
#include <p24HJ64GP206A.h>
#endif

#if defined(__PIC24HJ64GP210__)
#include <p24HJ64GP210.h>
#endif

#if defined(__PIC24HJ64GP210A__)
#include <p24HJ64GP210A.h>
#endif

#if defined(__PIC24HJ64GP502__)
#include <p24HJ64GP502.h>
#endif

#if defined(__PIC24HJ64GP504__)
#include <p24HJ64GP504.h>
#endif

#if defined(__PIC24HJ64GP506__)
#include <p24HJ64GP506.h>
#endif

#if defined(__PIC24HJ64GP506A__)
#include <p24HJ64GP506A.h>
#endif

#if defined(__PIC24HJ64GP510__)
#include <p24HJ64GP510.h>
#endif

#if defined(__PIC24HJ64GP510A__)
#include <p24HJ64GP510A.h>
#endif

#if defined(__dsPIC30F1010__)
#include <p30F1010.h>
#endif

#if defined(__dsPIC30F2010__)
#include <p30F2010.h>
#endif

#if defined(__dsPIC30F2011__)
#include <p30F2011.h>
#endif

#if defined(__dsPIC30F2012__)
#include <p30F2012.h>
#endif

#if defined(__dsPIC30F2020__)
#include <p30F2020.h>
#endif

#if defined(__dsPIC30F2023__)
#include <p30F2023.h>
#endif

#if defined(__dsPIC30F3010__)
#include <p30F3010.h>
#endif

#if defined(__dsPIC30F3011__)
#include <p30F3011.h>
#endif

#if defined(__dsPIC30F3012__)
#include <p30F3012.h>
#endif

#if defined(__dsPIC30F3013__)
#include <p30F3013.h>
#endif

#if defined(__dsPIC30F3014__)
#include <p30F3014.h>
#endif

#if defined(__dsPIC30F4011__)
#include <p30F4011.h>
#endif

#if defined(__dsPIC30F4012__)
#include <p30F4012.h>
#endif

#if defined(__dsPIC30F4013__)
#include <p30F4013.h>
#endif

#if defined(__dsPIC30F5011__)
#include <p30F5011.h>
#endif

#if defined(__dsPIC30F5013__)
#include <p30F5013.h>
#endif

#if defined(__dsPIC30F5015__)
#include <p30F5015.h>
#endif

#if defined(__dsPIC30F5016__)
#include <p30F5016.h>
#endif

#if defined(__dsPIC30F6010__)
#include <p30F6010.h>
#endif

#if defined(__dsPIC30F6010A__)
#include <p30F6010A.h>
#endif

#if defined(__dsPIC30F6011__)
#include <p30F6011.h>
#endif

#if defined(__dsPIC30F6011A__)
#include <p30F6011A.h>
#endif

#if defined(__dsPIC30F6012__)
#include <p30F6012.h>
#endif

