jRicardoChG/dsPic/dsPicADCMOTOR/xc.h
#if defined(__dsPIC33EP64GS506__)
#include <p33EP64GS506.h>
#endif

#if defined(__dsPIC33EP64GS708__)
#include <p33EP64GS708.h>
#endif

#if defined(__dsPIC33EP64GS804__)
#include <p33EP64GS804.h>
#endif

#if defined(__dsPIC33EP64GS805__)
#include <p33EP64GS805.h>
#endif

#if defined(__dsPIC33EP64GS806__)
#include <p33EP64GS806.h>
#endif

#if defined(__dsPIC33EP64GS808__)
#include <p33EP64GS808.h>
#endif

#if defined(__dsPIC33EP64MC202__)
#include <p33EP64MC202.h>
#endif

#if defined(__dsPIC33EP64MC203__)
#include <p33EP64MC203.h>
#endif

#if defined(__dsPIC33EP64MC204__)
#include <p33EP64MC204.h>
#endif

#if defined(__dsPIC33EP64MC206__)
#include <p33EP64MC206.h>
#endif

#if defined(__dsPIC33EP64MC502__)
#include <p33EP64MC502.h>
#endif

#if defined(__dsPIC33EP64MC503__)
#include <p33EP64MC503.h>
#endif

#if defined(__dsPIC33EP64MC504__)
#include <p33EP64MC504.h>
#endif

#if defined(__dsPIC33EP64MC506__)
#include <p33EP64MC506.h>
#endif

#if defined(__dsPIC33EV128GM002__)
#include <p33EV128GM002.h>
#endif

#if defined(__dsPIC33EV128GM004__)
#include <p33EV128GM004.h>
#endif

#if defined(__dsPIC33EV128GM006__)
#include <p33EV128GM006.h>
#endif

#if defined(__dsPIC33EV128GM102__)
#include <p33EV128GM102.h>
#endif

#if defined(__dsPIC33EV128GM104__)
#include <p33EV128GM104.h>
#endif

#if defined(__dsPIC33EV128GM106__)
#include <p33EV128GM106.h>
#endif

#if defined(__dsPIC33EV256GM002__)
#include <p33EV256GM002.h>
#endif

#if defined(__dsPIC33EV256GM004__)
#include <p33EV256GM004.h>
#endif

#if defined(__dsPIC33EV256GM006__)
#include <p33EV256GM006.h>
#endif

#if defined(__dsPIC33EV256GM102__)
#include <p33EV256GM102.h>
#endif

#if defined(__dsPIC33EV256GM104__)
#include <p33EV256GM104.h>
#endif

#if defined(__dsPIC33EV256GM106__)
#include <p33EV256GM106.h>
#endif

#if defined(__dsPIC33EV32GM002__)
#include <p33EV32GM002.h>
#endif

#if defined(__dsPIC33EV32GM004__)
#include <p33EV32GM004.h>
#endif

#if defined(__dsPIC33EV32GM006__)
#include <p33EV32GM006.h>
#endif

#if defined(__dsPIC33EV32GM102__)
#include <p33EV32GM102.h>
#endif

#if defined(__dsPIC33EV32GM104__)
#include <p33EV32GM104.h>
#endif

#if defined(__dsPIC33EV32GM106__)
#include <p33EV32GM106.h>
#endif

#if defined(__dsPIC33EV64GM002__)
#include <p33EV64GM002.h>
#endif

#if defined(__dsPIC33EV64GM004__)
#include <p33EV64GM004.h>
#endif

#if defined(__dsPIC33EV64GM006__)
#include <p33EV64GM006.h>
#endif

#if defined(__dsPIC33EV64GM102__)
#include <p33EV64GM102.h>
#endif

#if defined(__dsPIC33EV64GM104__)
#include <p33EV64GM104.h>
#endif

#if defined(__dsPIC33EV64GM106__)
#include <p33EV64GM106.h>
#endif

#if defined(__dsPIC33FJ06GS001__)
#include <p33FJ06GS001.h>
#endif

#if defined(__dsPIC33FJ06GS101__)
#include <p33FJ06GS101.h>
#endif

#if defined(__dsPIC33FJ06GS101A__)
#include <p33FJ06GS101A.h>
#endif

#if defined(__dsPIC33FJ06GS102__)
#include <p33FJ06GS102.h>
#endif

#if defined(__dsPIC33FJ06GS102A__)
#include <p33FJ06GS102A.h>
#endif

#if defined(__dsPIC33FJ06GS202__)
#include <p33FJ06GS202.h>
#endif

#if defined(__dsPIC33FJ06GS202A__)
#include <p33FJ06GS202A.h>
#endif

#if defined(__dsPIC33FJ09GS302__)
#include <p33FJ09GS302.h>
#endif

#if defined(__dsPIC33FJ128GP202__)
#include <p33FJ128GP202.h>
#endif

#if defined(__dsPIC33FJ128GP204__)
#include <p33FJ128GP204.h>
#endif

#if defined(__dsPIC33FJ128GP206__)
#include <p33FJ128GP206.h>
#endif

#if defined(__dsPIC33FJ128GP206A__)
#include <p33FJ128GP206A.h>
#endif

#if defined(__dsPIC33FJ128GP306__)
#include <p33FJ128GP306.h>
#endif

#if defined(__dsPIC33FJ128GP306A__)
#include <p33FJ128GP306A.h>
#endif

#if defined(__dsPIC33FJ128GP310__)
#include <p33FJ128GP310.h>
#endif

#if defined(__dsPIC33FJ128GP310A__)
#include <p33FJ128GP310A.h>
#endif

#if defined(__dsPIC33FJ128GP706__)
#include <p33FJ128GP706.h>
#endif

#if defined(__dsPIC33FJ128GP706A__)
#include <p33FJ128GP706A.h>
#endif

#if defined(__dsPIC33FJ128GP708__)
#include <p33FJ128GP708.h>
#endif

#if defined(__dsPIC33FJ128GP708A__)
#include <p33FJ128GP708A.h>
#endif

#if defined(__dsPIC33FJ128GP710__)
#include <p33FJ128GP710.h>
#endif

#if defined(__dsPIC33FJ128GP710A__)
#include <p33FJ128GP710A.h>
#endif

#if defined(__dsPIC33FJ128GP802__)
#include <p33FJ128GP802.h>
#endif

#if defined(__dsPIC33FJ128GP804__)
#include <p33FJ128GP804.h>
#endif

#if defined(__dsPIC33FJ128MC202__)
#include <p33FJ128MC202.h>
#endif

#if defined(__dsPIC33FJ128MC204__)
#include <p33FJ128MC204.h>
#endif

#if defined(__dsPIC33FJ128MC506__)
#include <p33FJ128MC506.h>
#endif

#if defined(__dsPIC33FJ128MC506A__)
#include <p33FJ128MC506A.h>
#endif

#if defined(__dsPIC33FJ128MC510__)
#include <p33FJ128MC510.h>
#endif

#if defined(__dsPIC33FJ128MC510A__)
#include <p33FJ128MC510A.h>
#endif

#if defined(__dsPIC33FJ128MC706__)
#include <p33FJ128MC706.h>
#endif

#if defined(__dsPIC33FJ128MC706A__)
#include <p33FJ128MC706A.h>
#endif

#if defined(__dsPIC33FJ128MC708__)
#include <p33FJ128MC708.h>
#endif

#if defined(__dsPIC33FJ128MC708A__)
#include <p33FJ128MC708A.h>
#endif

#if defined(__dsPIC33FJ128MC710__)
#include <p33FJ128MC710.h>
#endif

#if defined(__dsPIC33FJ128MC710A__)
#include <p33FJ128MC710A.h>
#endif

#if defined(__dsPIC33FJ128MC802__)
#include <p33FJ128MC802.h>
#endif

#if defined(__dsPIC33FJ128MC804__)
#include <p33FJ128MC804.h>
#endif

#if defined(__dsPIC33FJ12GP201__)
#include <p33FJ12GP201.h>
#endif

#if defined(__dsPIC33FJ12GP202__)
#include <p33FJ12GP202.h>
#endif

#if defined(__dsPIC33FJ12MC201__)
#include <p33FJ12MC201.h>
#endif

#if defined(__dsPIC33FJ12MC202__)
#include <p33FJ12MC202.h>
#endif

#if defined(__dsPIC33FJ16GP101__)
#include <p33FJ16GP101.h>
#endif

#if defined(__dsPIC33FJ16GP102__)
#include <p33FJ16GP102.h>
#endif

#if defined(__dsPIC33FJ16GP304__)
#include <p33FJ16GP304.h>
#endif

#if defined(__dsPIC33FJ16GS402__)
#include <p33FJ16GS402.h>
#endif

#if defined(__dsPIC33FJ16GS404__)
#include <p33FJ16GS404.h>
#endif

#if defined(__dsPIC33FJ16GS502__)
#include <p33FJ16GS502.h>
#endif

#if defined(__dsPIC33FJ16GS504__)
#include <p33FJ16GS504.h>
#endif

#if defined(__dsPIC33FJ16MC101__)
#include <p33FJ16MC101.h>
#endif

#if defined(__dsPIC33FJ16MC102__)
#include <p33FJ16MC102.h>
#endif

