jRicardoChG/dsPic/dsPicADCMOTOR/xc.h
#if defined(__dsPIC33FJ16MC304__)
#include <p33FJ16MC304.h>
#endif

#if defined(__dsPIC33FJ256GP506__)
#include <p33FJ256GP506.h>
#endif

#if defined(__dsPIC33FJ256GP506A__)
#include <p33FJ256GP506A.h>
#endif

#if defined(__dsPIC33FJ256GP510__)
#include <p33FJ256GP510.h>
#endif

#if defined(__dsPIC33FJ256GP510A__)
#include <p33FJ256GP510A.h>
#endif

#if defined(__dsPIC33FJ256GP710__)
#include <p33FJ256GP710.h>
#endif

#if defined(__dsPIC33FJ256GP710A__)
#include <p33FJ256GP710A.h>
#endif

#if defined(__dsPIC33FJ256MC510__)
#include <p33FJ256MC510.h>
#endif

#if defined(__dsPIC33FJ256MC510A__)
#include <p33FJ256MC510A.h>
#endif

#if defined(__dsPIC33FJ256MC710__)
#include <p33FJ256MC710.h>
#endif

#if defined(__dsPIC33FJ256MC710A__)
#include <p33FJ256MC710A.h>
#endif

#if defined(__dsPIC33FJ32GP101__)
#include <p33FJ32GP101.h>
#endif

#if defined(__dsPIC33FJ32GP102__)
#include <p33FJ32GP102.h>
#endif

#if defined(__dsPIC33FJ32GP104__)
#include <p33FJ32GP104.h>
#endif

#if defined(__dsPIC33FJ32GP202__)
#include <p33FJ32GP202.h>
#endif

#if defined(__dsPIC33FJ32GP204__)
#include <p33FJ32GP204.h>
#endif

#if defined(__dsPIC33FJ32GP302__)
#include <p33FJ32GP302.h>
#endif

#if defined(__dsPIC33FJ32GP304__)
#include <p33FJ32GP304.h>
#endif

#if defined(__dsPIC33FJ32GS406__)
#include <p33FJ32GS406.h>
#endif

#if defined(__dsPIC33FJ32GS606__)
#include <p33FJ32GS606.h>
#endif

#if defined(__dsPIC33FJ32GS608__)
#include <p33FJ32GS608.h>
#endif

#if defined(__dsPIC33FJ32GS610__)
#include <p33FJ32GS610.h>
#endif

#if defined(__dsPIC33FJ32MC101__)
#include <p33FJ32MC101.h>
#endif

#if defined(__dsPIC33FJ32MC102__)
#include <p33FJ32MC102.h>
#endif

#if defined(__dsPIC33FJ32MC104__)
#include <p33FJ32MC104.h>
#endif

#if defined(__dsPIC33FJ32MC202__)
#include <p33FJ32MC202.h>
#endif

#if defined(__dsPIC33FJ32MC204__)
#include <p33FJ32MC204.h>
#endif

#if defined(__dsPIC33FJ32MC302__)
#include <p33FJ32MC302.h>
#endif

#if defined(__dsPIC33FJ32MC304__)
#include <p33FJ32MC304.h>
#endif

#if defined(__dsPIC33FJ64GP202__)
#include <p33FJ64GP202.h>
#endif

#if defined(__dsPIC33FJ64GP204__)
#include <p33FJ64GP204.h>
#endif

#if defined(__dsPIC33FJ64GP206__)
#include <p33FJ64GP206.h>
#endif

#if defined(__dsPIC33FJ64GP206A__)
#include <p33FJ64GP206A.h>
#endif

#if defined(__dsPIC33FJ64GP306__)
#include <p33FJ64GP306.h>
#endif

#if defined(__dsPIC33FJ64GP306A__)
#include <p33FJ64GP306A.h>
#endif

#if defined(__dsPIC33FJ64GP310__)
#include <p33FJ64GP310.h>
#endif

#if defined(__dsPIC33FJ64GP310A__)
#include <p33FJ64GP310A.h>
#endif

#if defined(__dsPIC33FJ64GP706__)
#include <p33FJ64GP706.h>
#endif

#if defined(__dsPIC33FJ64GP706A__)
#include <p33FJ64GP706A.h>
#endif

#if defined(__dsPIC33FJ64GP708__)
#include <p33FJ64GP708.h>
#endif

#if defined(__dsPIC33FJ64GP708A__)
#include <p33FJ64GP708A.h>
#endif

#if defined(__dsPIC33FJ64GP710__)
#include <p33FJ64GP710.h>
#endif

#if defined(__dsPIC33FJ64GP710A__)
#include <p33FJ64GP710A.h>
#endif

#if defined(__dsPIC33FJ64GP802__)
#include <p33FJ64GP802.h>
#endif

#if defined(__dsPIC33FJ64GP804__)
#include <p33FJ64GP804.h>
#endif

#if defined(__dsPIC33FJ64GS406__)
#include <p33FJ64GS406.h>
#endif

#if defined(__dsPIC33FJ64GS606__)
#include <p33FJ64GS606.h>
#endif

#if defined(__dsPIC33FJ64GS608__)
#include <p33FJ64GS608.h>
#endif

#if defined(__dsPIC33FJ64GS610__)
#include <p33FJ64GS610.h>
#endif

#if defined(__dsPIC33FJ64MC202__)
#include <p33FJ64MC202.h>
#endif

#if defined(__dsPIC33FJ64MC204__)
#include <p33FJ64MC204.h>
#endif

#if defined(__dsPIC33FJ64MC506__)
#include <p33FJ64MC506.h>
#endif

#if defined(__dsPIC33FJ64MC506A__)
#include <p33FJ64MC506A.h>
#endif

#if defined(__dsPIC33FJ64MC508__)
#include <p33FJ64MC508.h>
#endif

#if defined(__dsPIC33FJ64MC508A__)
#include <p33FJ64MC508A.h>
#endif

#if defined(__dsPIC33FJ64MC510__)
#include <p33FJ64MC510.h>
#endif

#if defined(__dsPIC33FJ64MC510A__)
#include <p33FJ64MC510A.h>
#endif

#if defined(__dsPIC33FJ64MC706__)
#include <p33FJ64MC706.h>
#endif

#if defined(__dsPIC33FJ64MC706A__)
#include <p33FJ64MC706A.h>
#endif

#if defined(__dsPIC33FJ64MC710__)
#include <p33FJ64MC710.h>
#endif

#if defined(__dsPIC33FJ64MC710A__)
#include <p33FJ64MC710A.h>
#endif

#if defined(__dsPIC33FJ64MC802__)
#include <p33FJ64MC802.h>
#endif

#if defined(__dsPIC33FJ64MC804__)
#include <p33FJ64MC804.h>
#endif

